docs/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-11 Tue 14:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Readme</title>
<meta name="author" content="Alberto Valdez" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://albertovaldez5.gitlab.io/org-template/resources/theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://albertovaldez5.gitlab.io/org-template/resources/theme/css/readtheorg.css"/>
<link rel="shortcut icon" href="https://albertovaldez5.gitlab.io/org-template/resources/theme/favicon.ico">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Readme
<br />
<span class="subtitle">GPTVA Notes</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#gpt-voice-assistant-notes">1. GPT Voice Assistant Notes</a>
<ul>
<li><a href="#plan">1.1. Plan</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-gpt-voice-assistant-notes" class="outline-2">
<h2 id="gpt-voice-assistant-notes"><span class="section-number-2">1.</span> GPT Voice Assistant Notes</h2>
<div class="outline-text-2" id="text-gpt-voice-assistant-notes">
<p>
This repository contains notes for a Python program for using GPT from OpenAI as a voice assistant.
</p>
</div>

<div id="outline-container-plan" class="outline-3">
<h3 id="plan"><span class="section-number-3">1.1.</span> Plan</h3>
<div class="outline-text-3" id="text-plan">
<p>
The plan is to create 5 different articles that tackle different sections of the program by functionality.
</p>

<ol class="org-ol">
<li>Part 1 - Audio Channel</li>
<li>Part 2 - AI Models and Services</li>
<li>Part 3 - Web Server and Storage</li>
<li>Part 4 - Flow and Conclusion</li>
</ol>

<p>
Part 1 will contain audio theory and practice for audio device, torchaudio, toml config file and audio calibration.
</p>

<p>
Part 2 will contain constructing classes for loading up local AI models, as well as connecting to remote AI services, plus loading SSML and a YAML file.
</p>

<p>
Part 3 will contain a simple SQL database, threading and a web socket server for serving HTML and updating messages in real time.
</p>

<p>
Part 4 will refine the application flow, setup commands, add extra functionality and suggest possible future improvements.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alberto Valdez</p>
<p class="date">Created: 2023-04-11 Tue 14:55</p>
</div>
</body>
</html>